Ran Plan for dir: `terraform/environments/prod/atlantis` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/84/default/terraform/environments/prod/atlantis/atlantis-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/84/default/terraform/environments/prod/atlantis": exit status 1
module.atlantis_ecr.data.aws_caller_identity.current: Reading...
module.atlantis_task_role.data.aws_caller_identity.current: Reading...
module.atlantis_ecs_tasks_sg.aws_security_group.this: Refreshing state... [id=sg-08c4287538bf499f5]
module.atlantis_efs_sg.aws_security_group.this: Refreshing state... [id=sg-01f30aae29b2f22a1]
aws_efs_file_system.atlantis: Refreshing state... [id=fs-0404558fae26deb97]
aws_kms_key.efs: Refreshing state... [id=16ebdf02-7634-495c-84ae-14da921267be]
module.atlantis_task_role.data.aws_region.current: Reading...
module.atlantis_alb.aws_lb_target_group.this["atlantis"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atlantis-prod-atlantis/ff36a9dae1ef42d0]
module.atlantis_alb_sg.aws_security_group.this: Refreshing state... [id=sg-01fe173c96fdcff19]
module.atlantis_task_execution_role.data.aws_region.current: Reading...
module.atlantis_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.atlantis_ecr.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
aws_secretsmanager_secret.atlantis-github-app: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt]
module.atlantis_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_vpc.main: Reading...
module.atlantis_task_execution_role.data.aws_caller_identity.current: Reading...
module.atlantis_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
aws_secretsmanager_secret.atlantis-webhook-secret: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7]
module.atlantis_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
aws_ecs_cluster.atlantis: Refreshing state... [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/atlantis-prod]
module.atlantis_logs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/atlantis-prod/application]
module.atlantis_task_execution_role.aws_iam_role.this: Refreshing state... [id=atlantis-ecs-task-execution-prod]
module.atlantis_task_role.aws_iam_role.this: Refreshing state... [id=atlantis-ecs-task-prod]
aws_kms_key.ecr: Refreshing state... [id=fb74c860-dfb9-498f-9937-976a098b103c]
data.aws_caller_identity.current: Reading...
aws_kms_alias.efs: Refreshing state... [id=alias/efs-atlantis]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.atlantis_efs_sg.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-09960d837f0c32a34]
module.atlantis_ecs_tasks_sg.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0b52fca0b56abf27a]
aws_kms_key_policy.efs: Refreshing state... [id=16ebdf02-7634-495c-84ae-14da921267be]
aws_ecs_cluster_capacity_providers.atlantis: Refreshing state... [id=atlantis-prod]
module.atlantis_alb_sg.aws_vpc_security_group_ingress_rule.alb-http["0.0.0.0/0"]: Refreshing state... [id=sgr-0dac4779e273d3855]
module.atlantis_alb_sg.aws_vpc_security_group_ingress_rule.alb-https["0.0.0.0/0"]: Refreshing state... [id=sgr-0c15c851bba992ab2]
module.atlantis_alb_sg.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-04d1a1c057b68bb63]
aws_efs_access_point.atlantis: Refreshing state... [id=fsap-015fe847f3b144192]
aws_efs_mount_target.atlantis[0]: Refreshing state... [id=fsmt-06087026eb674dc79]
aws_efs_mount_target.atlantis[1]: Refreshing state... [id=fsmt-0ff0dbacfb68b58e7]
aws_kms_alias.ecr: Refreshing state... [id=alias/ecr-atlantis]
aws_kms_key_policy.ecr: Refreshing state... [id=fb74c860-dfb9-498f-9937-976a098b103c]
data.aws_vpc.main: Read complete after 0s [id=vpc-0f162b9e588276e09]
module.atlantis_alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/e9ee6510f2019baf]
module.atlantis_ecs_tasks_sg.aws_vpc_security_group_ingress_rule.custom["0"]: Refreshing state... [id=sgr-016ae63cdef0d5cae]
data.aws_subnets.private: Reading...
module.atlantis_efs_sg.aws_vpc_security_group_ingress_rule.custom["0"]: Refreshing state... [id=sgr-01b8504645ccdbfb8]
module.atlantis_ecr.aws_ecr_repository.this: Refreshing state... [id=atlantis]
module.vpc_endpoints_sg.aws_security_group.this: Refreshing state... [id=sg-00c90bfe3917ed409]
data.aws_subnets.private: Read complete after 0s [id=ap-northeast-2]
data.aws_route_tables.private: Reading...
aws_vpc_endpoint.ecr-api: Refreshing state... [id=vpce-0771cfdc087d31c5b]
module.vpc_endpoints_sg.aws_vpc_security_group_ingress_rule.vpc-endpoint-cidr["10.0.0.0/16"]: Refreshing state... [id=sgr-04c2a8ac4a247ce66]
aws_vpc_endpoint.ecr-dkr: Refreshing state... [id=vpce-0a8c3a30df63ea53b]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-0d2a42aea9646d5f1]
data.aws_route_tables.private: Read complete after 0s [id=ap-northeast-2]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-0b218cc766bee3ac8]
module.atlantis_ecr.aws_ssm_parameter.repository-url[0]: Refreshing state... [id=/shared/ecr/atlantis-repository-url]
module.atlantis_ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=atlantis]
module.atlantis_ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=atlantis]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-00abd3a9518c62884]
module.atlantis_alb.aws_lb_listener.https["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/e9ee6510f2019baf/030a63300e4016ac]
module.atlantis_alb.aws_lb_listener.http["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/e9ee6510f2019baf/7a16c5e0733f8e5c]
aws_iam_role_policy.atlantis-task-execution-kms: Refreshing state... [id=atlantis-ecs-task-execution-prod:kms-decryption]
aws_iam_role_policy_attachment.atlantis-task-execution-policy: Refreshing state... [id=atlantis-ecs-task-execution-prod-20251127085747351400000001]
aws_iam_role_policy.atlantis-task-execution-secrets: Refreshing state... [id=atlantis-ecs-task-execution-prod:secrets-access]
aws_iam_role_policy.atlantis-terraform-operations: Refreshing state... [id=atlantis-ecs-task-prod:terraform-operations]
aws_iam_role_policy.atlantis-efs-access: Refreshing state... [id=atlantis-ecs-task-prod:efs-access]
aws_ecs_service.atlantis: Refreshing state... [id=arn:aws:ecs:ap-northeast-2:646886795421:service/atlantis-prod/atlantis-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_ecs_service.atlantis will be updated in-place
  ~ resource "aws_ecs_service" "atlantis" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/atlantis-prod/atlantis-prod"
        name                               = "atlantis-prod"
        tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
            "Team"        = "platform-team"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:11" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.atlantis will be created
  + resource "aws_ecs_task_definition" "atlantis" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "ATLANTIS_ATLANTIS_URL"
                          + value = "https://atlantis.set-of.com"
                        },
                      + {
                          + name  = "ATLANTIS_LOG_LEVEL"
                          + value = "debug"
                        },
                      + {
                          + name  = "ATLANTIS_PORT"
                          + value = "4141"
                        },
                      + {
                          + name  = "ATLANTIS_REPO_ALLOWLIST"
                          + value = "github.com/ryu-qqq/*"
                        },
                      + {
                          + name  = "ATLANTIS_REPO_CONFIG"
                          + value = "/home/atlantis/repos.yaml"
                        },
                      + {
                          + name  = "ATLANTIS_WRITE_GIT_CREDS"
                          + value = "true"
                        },
                    ]
                  + essential        = true
                  + healthCheck      = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4141/healthz || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 60
                      + timeout     = 5
                    }
                  + image            = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis:v0.30.0"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/atlantis-prod/application"
                          + awslogs-region        = "ap-northeast-2"
                          + awslogs-stream-prefix = "atlantis"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/home/atlantis/.atlantis"
                          + readOnly      = false
                          + sourceVolume  = "atlantis-data"
                        },
                    ]
                  + name             = "atlantis"
                  + portMappings     = [
                      + {
                          + containerPort = 4141
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "ATLANTIS_GH_APP_ID"
                          + valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:app_id::"
                        },
                      + {
                          + name      = "ATLANTIS_GH_APP_INSTALLATION_ID"
                          + valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:installation_id::"
                        },
                      + {
                          + name      = "ATLANTIS_GH_APP_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:private_key::"
                        },
                      + {
                          + name      = "ATLANTIS_GH_WEBHOOK_SECRET"
                          + valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7:webhook_secret::"
                        },
                    ]
                  + ulimits          = [
                      + {
                          + hardLimit = 65536
                          + name      = "nofile"
                          + softLimit = 65536
                        },
                    ]
                },
            ]
        )
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::646886795421:role/atlantis-ecs-task-execution-prod"
      + family                   = "atlantis-prod"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task definition for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      + tags_all                 = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task definition for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      + task_role_arn            = "arn:aws:iam::646886795421:role/atlantis-ecs-task-prod"
      + track_latest             = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "atlantis-data"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0404558fae26deb97"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049

              + authorization_config {
                  + access_point_id = "fsap-015fe847f3b144192"
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_iam_role_policy.atlantis-terraform-operations will be updated in-place
  ~ resource "aws_iam_role_policy" "atlantis-terraform-operations" {
        id          = "atlantis-ecs-task-prod:terraform-operations"
        name        = "terraform-operations"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (22 unchanged elements hidden)
                    {
                        Action   = [
                            "application-autoscaling:DescribeScalableTargets",
                            "application-autoscaling:DescribeScalingPolicies",
                            "application-autoscaling:ListTagsForResource",
                            "application-autoscaling:RegisterScalableTarget",
                            "application-autoscaling:DeregisterScalableTarget",
                            "application-autoscaling:PutScalingPolicy",
                            "application-autoscaling:DeleteScalingPolicy",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "ManageApplicationAutoScaling"
                    },
                  - {
                      - Action   = [
                          - "servicediscovery:GetService",
                          - "servicediscovery:GetNamespace",
                          - "servicediscovery:ListServices",
                          - "servicediscovery:ListNamespaces",
                          - "servicediscovery:CreateService",
                          - "servicediscovery:UpdateService",
                          - "servicediscovery:DeleteService",
                          - "servicediscovery:RegisterInstance",
                          - "servicediscovery:DeregisterInstance",
                          - "servicediscovery:GetInstance",
                          - "servicediscovery:ListInstances",
                          - "servicediscovery:TagResource",
                          - "servicediscovery:UntagResource",
                          - "servicediscovery:ListTagsForResource",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ServiceDiscoveryAccess"
                    },
                    {
                        Action   = [
                            "iam:PassRole",
                            "iam:PutRolePolicy",
                            "iam:DeleteRolePolicy",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:iam::646886795421:role/crawlinghub-*-task-role-prod",
                            "arn:aws:iam::646886795421:role/crawlinghub-*-execution-role-prod",
                        ]
                        Sid      = "ManageCrawlingHubRoles"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ atlantis_task_definition_arn         = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:11" -> (known after apply)
  ~ atlantis_task_definition_revision    = 11 -> (known after apply)
╷
│ Error: reading ECR Lifecycle Policy (atlantis): operation error ECR: GetLifecyclePolicy, https response error StatusCode: 400, RequestID: 03daca91-c4fc-4d3f-98a9-7185b92c4949, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/c0393a9794c64774b56dbd940f473b7a is not authorized to perform: ecr:GetLifecyclePolicy on resource: arn:aws:ecr:ap-northeast-2:646886795421:repository/atlantis because no identity-based policy allows the ecr:GetLifecyclePolicy action
│ 
│   with module.atlantis_ecr.aws_ecr_lifecycle_policy.this[0],
│   on ../../../modules/ecr/main.tf line 47, in resource "aws_ecr_lifecycle_policy" "this":
│   47: resource "aws_ecr_lifecycle_policy" "this" {
│ 
╵
╷
│ Error: reading ECR Repository Policy (atlantis): operation error ECR: GetRepositoryPolicy, https response error StatusCode: 400, RequestID: 788eb51d-2086-4e43-92c4-c3d6ab5ac722, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/c0393a9794c64774b56dbd940f473b7a is not authorized to perform: ecr:GetRepositoryPolicy on resource: arn:aws:ecr:ap-northeast-2:646886795421:repository/atlantis because no identity-based policy allows the ecr:GetRepositoryPolicy action
│ 
│   with module.atlantis_ecr.aws_ecr_repository_policy.this[0],
│   on ../../../modules/ecr/main.tf line 84, in resource "aws_ecr_repository_policy" "this":
│   84: resource "aws_ecr_repository_policy" "this" {
│ 
╵

```
</details>